package com.example.quiz_app

object LocalDataSource {


        val questions = mutableListOf<Quiz>(
            Quiz("বাংলাদেশের শিল্প রাজধানী কোনটি?",
                listOf("নোয়াখালী", "চট্টগ্রাম", "ঢাকা", "বরিশাল"),
                1
            ),

            Quiz("বাংলাদেশের জাতীয় ফল কী?",
                listOf("আম", "কাঁঠাল", "কলা", "লিচু"),
                1
            ),

            Quiz("বাংলাদেশ স্বাধীনতা লাভ করে কোন সালে?",
                listOf("১৯৫২", "১৯৬৫", "১৯৭১", "১৯৮০"),
                2
            ),

            Quiz("বাংলাদেশের মুদ্রার নাম কী?",
                listOf("ডলার", "ইউরো", "টাকা", "রুপি"),
                2
            ),

            Quiz("বাংলাদেশের জাতির জনক কে?",
                listOf("এ. কে. ফজলুল হক", "শেখ মুজিবুর রহমান", "জিয়াউর রহমান", "তাজউদ্দিন আহমদ"),
                1
            ),

            Quiz("বাংলাদেশের জাতীয় প্রাণী কী?",
                listOf("হাতি", "বাঘ", "গরু", "হরিণ"),
                1
            ),

            Quiz("বাংলাদেশের প্রাণরেখা নামে পরিচিত নদী কোনটি?",
                listOf("পদ্মা", "যমুনা", "মেঘনা", "ব্রহ্মপুত্র"),
                0
            ),

            Quiz("বাংলাদেশের রাজধানী কোনটি?",
                listOf("রাজশাহী", "ঢাকা", "সিলেট", "খুলনা"),
                1
            ),

            Quiz("মসলিন কাপড়ের জন্য কোন জেলা বিখ্যাত?",
                listOf("নরসিংদী", "ঢাকা", "রাজশাহী", "নারায়ণগঞ্জ"),
                3
            ),

            Quiz("বাংলাদেশের জাতীয় ফুল কী?",
                listOf("গোলাপ", "শাপলা", "সূর্যমুখী", "পদ্ম"),
                1
            )
        )
}